Repository: MohamedOsama012/mawhibty
Catalog: lib/l10n/intl_*.arb
Languages: ar

# appTitle
source: Mawhibty
ar: موهبتي

# onboardingTitle1
source: Your journey begins... Show us your skills!
ar: مستقبلك الرياضي بيبدأ هنا!

# onboardingDesc1
source: Every level brings you closer to your dream! Let’s see your magic touch.
ar: سواء كنت لاعب موهوب أو نادي بيدوّر على نجوم، منصتنا بتفتحلك الطريق... جاهز تحقق حلمك؟

# onboardingTitle2
source: Skills aren’t just words... Prove them!
ar: أثبت موهبتك... أو اكتشفها!

# onboardingDesc2
source: Record yourself, upload the video, and let the ball speak for you.
ar: صور مهاراتك وارفعها، أو حدّد متطلبات فريقك وسيب الباقي علينا... إحنا هنا عشان نوصلك للطريق الصح.

# onboardingTitle3
source: New level? New star? Let’s go!
ar: رحلة النجومية تبدأ بخطوة!

# onboardingDesc3
source: Complete tasks to earn stars... Your path to pro starts here.
ar: مع كل تحدي أو طلب، فرصتك للتميز بتكبر... يلا نكمل المشوار مع بعض!

source: Next
ar: التالي

source: Start
ar: ابدأ

# login_screen_title
source: Login
ar: تسجيل الدخول

# login_screen_welcome
source: Welcome! Let's begin your tour.
ar: أهلا بيك! يلا ندخل على جولتك!

# login_screen_email_hint
source: Email address
ar: البريد الالكتروني

# login_screen_password_hint
source: Password
ar: كلمة المرور

# login_screen_forget_password
source: Forgot password?
ar: نسيت كلمة المرور؟

# login_screen_create_account
source: Don't have an account?
ar: ليس لدي حساب؟

# login_screen_create_account_button
source: Create an account
ar: انشاء حساب

# login_screen_login_button
source: Let's Go!
ar: يلا بينا!

# forget_password_screen_title
source: Forgot Password?
ar: نسيت كلمةالمرور؟

# forget_password_screen_instruction
source: No worries, we’ll get your account back in seconds!
ar: حصل خير… هنرجّعلك حسابك في ثواني!

# forget_password_screen_email_hint
source: Enter email or phone number
ar: أدخل الهاتف أو البريد الإلكتروني

# forget_password_screen_send_code_button
source: Send Code
ar: ابعتولي الكود!

# forget_password_email_required
source: Please enter your email or phone number.
ar: أدخل الهاتف أو البريد الإلكتروني

# forget_password_email_invalid
source: Please enter a valid email address or phone number.
ar: برجاء ادخال بريد الكتروني او رقم هاتف صالح.

# otp_screen_title
source: Verify OTP
ar: تحقق من OTP

# otp_screen_instruction
source: Check your message and enter the code!
ar: الكود جالك... افتح الرسالة و ادخل الأرقام!

# otp_screen_didnot_receive_code
source: Didn't receive the code?
ar: لم تتلق الرمز؟

# otp_screen_resend_button
source: Resend
ar: أعد الإرسال

# otp_required
source: Please enter the OTP.
ar: برجاء ادخال الكود

# otp_invalid
source: Please enter a valid OTP.
ar: برجاء ادخال كود صحيح.

# otp_sent
source: OTP sent successfully.
ar: تم ارسال الكود بنجاح

# otp_not_complete
source: Please enter the full code.
ar: الرجاء إدخال الرمز الكامل

# otp_button
source: Verify
ar: تحقق

# new_password_screen_title
source: New Password
ar: كلمة مرور جديدة

# new_password_screen_instruction
source: New password? Keep it safe this time
ar: كلمة سر جديدة؟ خليك فاكرها المرة دي

# new_password_screen_password_hint
source: Password
ar: كلمة المرور

# new_password_screen_confirm_password_hint
source: Confirm Password
ar: تأكيد كلمة المرور

# new_password_screen_update_button
source: Enter the App!
ar: ادخل على التطبيق!

# email_required
source: Please enter your email.
ar: برجاء ادخال البريد الالكتروني.

# email_invalid
source: Please enter a valid email address.
ar: برجاء ادخال بريد الكتروني صالح.

# name_required
source: Please enter your name
ar: برجاء ادخال الاسم.

# name_short
source: Name must be at least 3 characters long.
ar: الاسم يجب ان يكون مكون من 3 حروف على الاقل.

# password_required
source: Please enter your password.
ar: برجاء ادخال كلمة المرور.

# password_short
source: Password must be at least 8 characters long.
ar: كلمة المرور يجب أن تكون مكونة من 8 أحرف على الأقل.

# password_mismatch
source: Passwords do not match.
ar: كلمة المرور غير متطابقة.

# register_screen_title
source: Create Account
ar: انشاء حساب

# register_screen_welcome
source: Ready to start your football journey? Sign up and show us your skills!
ar: جاهز تبدأ مشوارك الكروي؟ سجّل و ورينا مهاراتك!

# register_screen_name_hint
source: Name
ar: الاسم

# register_screen_email_hint
source: Email
ar: البريد الالكتروني

# register_screen_password_hint
source: Password
ar: كلمة المرور

# register_screen_confirm_password_hint
source: Confirm Password
ar: تأكيد كلمة المرور

# register_screen_register_button
source: Let's continue!
ar: يلا نكمل!

# register_screen_have_account
source: Already have an account?
ar: لدي حساب؟

# register_screen_login_button
source: Login
ar: تسجيل الدخول
